import math
import matplotlib.pyplot as plt

# Константы Кербина
T = 288                                  # - температура в Кельвинах
R = 600e3                                # - радиус планеты
G = 6.6e-11                              # - гравитационная постоянная
e = 2.71828                              # - экспонента
rho0 = 1.225                             # - плотность атмосферы на уровне моря
MlMass = 0.029                           # - молекулярная масса атмосферы
GasConst = 8.314                         # - универсальная газовая постоянная
MKerbin = 5.2915158e22                   # - масса планеты
p0 = (rho0 * GasConst * T) / MlMass      # - давление на уровне моря

# Константы аппарата
C = 0.2                                 # - коэффициент лобового сопротивления (форма - конус)
d = 6.5                                  # - диаметр ракеты. без 1-ой ступени 2.3
S = math.pi * (d / 2) **2                # - площадь сечения ракеты
time_next_stage1 = 74                    # - время работы 1-ой ступени
time_next_stage2 = 137                   # - время работы 2-ой ступени
time_next_stage3 = 158                   # - время работы 3-ой ступени
stage1_Fthr = (1_583_590 + 1_683_600) / 2# - сила тяги 1-ой ступени
stage2_Fthr = (387_000 + 388_000) / 2    # - сила тяги 2-ой ступени
stage3_Fthr = 219_000                    # - сила тяги 3-ей ступени

m_start = 85_265.4                       # - начальная масса ракеты

m1 = 85_265.4                            # - масса 1-ой ступени            
m1_dry = 24601.4                         # - масса 1-ой ступени без топлива
m1_fuel = m1 - m1_dry                    # - масса 1-ой ступени ТОЛЬКО ТОПЛИВО 

m2 = 30_220.31                           # - масса 2-ой ступени
m2_dry = 12_421.4                        # - масса 2-ой ступени без топлива
m2_fuel = m2 - m2_dry                    # - масса 2-ой ступени ТОЛЬКО ТОПЛИВО
stage2 = False

m3 = 17_813.12                           # - масса 3-ей ступени
m3_dry = 8_111.4                         # - масса 3-ей ступени без топлива
m3_fuel = m3 - m3_dry                    # - масса 3-ей ступени ТОЛЬКО ТОПЛИВО
stage3 = False  

m_end = 16_342.18                        # - конечная масса ракеты
m_end_dry = 8_111.4                      # - конченая СУХАЯ масса
m_end_fuel = m_end - m_end_dry           # - конечная масса топлива

total_time = 158                         # - полное время полёта
dt = 0.01                                # - шаг времени

k1 = (m1_fuel- m2_fuel) / (time_next_stage1)                        # - коэффициент расхода топлива 1-ой ступени
k2 = (m2_fuel - m3_fuel) / (time_next_stage2 - time_next_stage1)    # - коэффициент расхода топлива 2-ой ступени
k3 = (m3_fuel - m_end_fuel) / (time_next_stage3 - time_next_stage2) # - коэффициент расхода топлива 3-ей ступени

start_turn_altitude = 250                # - высота начала наклона ракеты
end_turn_altitude = 45000                # - высота конца наклона ракеты

# Функция изменения угла между тягой и осью OX
def f_turn_pitch(h):
    if h <= start_turn_altitude:    
        return math.pi / 2
    elif h > end_turn_altitude:
        return math.radians(45)
    else:
        return (math.pi / 2) - (((h - start_turn_altitude) / (end_turn_altitude - start_turn_altitude)) * (math.radians(45)))

# Функция подсчета угла между силой тяжести и осью OX
def gravity_direction_angle(x, y, h):
    if h <= 250:
        return math.pi / 2
    else:
        return math.atan2(y, x)

# Начальные значения и саиски значений
V = 0
h = 0
m = m_start
v_values = [0]
x_values = [0]
y_values = [0]
vx_values = [0]
vy_values = [0]
phi = math.radians(90)
theta = math.radians(90)
h_values = [0]

# Основной цикл изменения времени и подсчета остальных значений
for i in range(int(total_time // dt)):
    t = i * dt
    x = x_values[-1]
    y = y_values[-1]
    vx = vx_values[-1]
    vy = vy_values[-1]

    # Тяга и расход для 1-ой ступени
    if t < time_next_stage1:
        F_thr = stage1_Fthr
        k = k1
        # Тяга и расход 2-ой ступени, сброс 1-ой ступени, а также изменение диаметра и площади сечения ракеты    
    elif t >= time_next_stage1 and t < time_next_stage2:
        F_thr = stage2_Fthr
        k = k2
        if not stage2:
            stage2 = True
            d = 2.3
            S = math.pi * (d/2)**2 
            m -= (m1_dry - m2_dry)

        # Тяга и расход 3-ой ступени, сброс 2-ой ступени, а также изменение диаметра и площади сечения ракеты
    else:
        F_thr = stage3_Fthr
        k = k3
        if not stage3:
            stage3 = True
            d = 2.3
            S = math.pi * (d/2)**2 
            m -= (m2_dry - m3_dry)

    m -= k * dt                              # уменьшение массы 

    h = math.sqrt(x ** 2 + (y + R) ** 2) - R # нахождение высоты по координатам
    theta = f_turn_pitch(h)                  # пересчет угла
    g = G * MKerbin / (R + h) ** 2           # пересчет гравитационной постоянной

    p = p0 * e ** (-(MlMass * g * h) / (GasConst * T))
    rho = (p * MlMass) / (GasConst * T)

    V = math.sqrt(vx ** 2 + vy ** 2)         # вычисление скорости

    F_resist = C * S * rho * V ** 2 / 2      # вычисление силы сопротивления

    phi = gravity_direction_angle(x, y, h)   # вычисление угла между гравитацией и осью X

    ax = ((F_thr - F_resist) * math.cos(theta)) / m - g * math.cos(phi)
    ay = ((F_thr - F_resist) * math.sin(theta)) / m - g * math.sin(phi)

    vx_new = vx + ax * dt
    vy_new = vy + ay * dt
    x_new = x + vx * dt
    y_new = y + vy * dt

    x_values.append(x_new)
    y_values.append(y_new)
    vx_values.append(vx_new)
    vy_values.append(vy_new)
    v_values.append(V)
    h_values.append(h)

time_array = [i * dt for i in range(len(x_values))]

# Время (секунды)
KSP_Time = [0, 
2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 
99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158]

# Высота (км)
KSP_Height = [0,
 0.11364211333403364, 0.18130014329298866, 0.28641914707305843, 0.4306990126395831, 0.6147924071332672, 0.8392511580082355, 1.1045839885751485, 1.4080107424292947, 1.7558772753041703, 2.1457064750415737, 2.577769934623735, 3.0523019287597855, 3.569527566832374, 4.129666025170241, 4.726500147154206, 5.370448821133934, 6.055472226399463, 6.775232450891286, 7.54457098647079, 8.34916562808107, 9.197514389076735, 10.10067044894374, 11.043492572390242, 12.038085951331421, 13.098817374034319, 14.219351941986709, 15.390410598032293, 16.63781964099931, 17.92577446428628, 19.294300979005058, 20.73253899870778, 22.25758305650379, 23.840535358518245, 25.49687061265146, 27.226683120295405, 29.029427343256888, 30.917731510399726, 31.48441547594557, 33.403135447163834, 35.302103582086275, 37.19942389322084, 39.11303076378606, 40.98567223392287, 42.87239453442278, 44.734529197839784, 46.58935562005255, 48.45372695936554, 50.30732034156425, 52.14827262798429, 53.95659015599778, 55.76633979228802, 57.5394903437224, 59.291740851142094, 61.03822981973435, 62.7608903635582, 64.44346624037775, 66.10364052779565, 67.75823650687583, 69.39112371845904, 71.0029830904979, 72.59437906420021, 74.15039008301694, 
75.68748871596391, 77.22136919521226, 78.72229352458567, 80.22092906761158, 81.70283502894128, 83.1687095830869, 84.61914221894217, 85.03275334138633, 86.46339416501404, 87.86544129241386, 89.2674030467912, 90.65571836923948, 92.01735461772012, 93.38006983467331, 94.7307442601755, 96.06992319907097, 97.38506851021829, 98.70304741019791]
KSP_Height = [h * 1000 for h in KSP_Height]  # Преобразуем в метры

# Скорость относительно поверхности (м/с)
KSP_Speed = [0,
 23.182353961187026, 42.54008537814947, 61.74878906484969, 81.30727383909979, 101.1619835524699, 121.27117269312323, 141.63738564833162, 161.95442242791216, 182.64195345007235, 203.49469783921955, 224.47802079128454, 245.61010526944182, 266.9023958082219, 288.38680671807737, 309.4123325071756, 329.96282850325764, 351.246433066276, 372.83343154553665, 395.28397864209035, 418.3029605996519, 
442.4598497065357, 468.49273067929226, 496.3461613887169, 526.561000316808, 559.5291352526234, 594.7745637370863, 631.6796820781473, 670.9948012539977, 711.5611365860137, 754.6081497602421, 799.7860208793314, 847.6120030776582, 897.1434533046049, 948.8134897754813, 1002.6130215028218, 1058.520192415319, 1096.8880517271195, 1096.8880517271195, 1108.3384131053335, 1117.4852592710897, 1126.9847338259117, 1136.8762933520097, 1146.811571815778, 1157.0481475230672, 1167.3534953614064, 1177.7993027094788, 1188.464642887121, 1199.220472009447, 1210.0428901385912, 1220.7996334505801, 1231.6806003876843, 1242.4443256413356, 1253.174663230671, 1264.3119280960004, 1276.3446646682835, 1289.1758527986908, 1302.9314264919874, 1317.7589846715507, 1333.5157354281996, 1350.1889604533928, 1367.7654819035195, 1386.046538349172, 1405.1907741475052, 1425.3917250206193, 1446.2385517763, 1468.137862644579, 1490.8754457890516, 1514.4416041314062, 1527.7124981835316, 1527.7124981835316, 1547.561460060276, 1563.339845161329, 1579.7362811162686, 1596.5924337600848, 1613.730401968705, 1631.4883795628377, 1649.6926284097706, 1668.3388706376531, 1687.2319813353627, 1706.7459798269895]

# График 1: Высота от времени
plt.figure(figsize=(10, 6))
plt.plot(time_array, h_values, label='Мат. модель', color='blue', linewidth=2)
plt.plot(KSP_Time, KSP_Height, label='KSP', color='red', linestyle='--', linewidth=2)
plt.title('Высота ракеты от времени', fontsize=12, fontweight="bold")
plt.xlabel('Время (с)')
plt.ylabel('Высота (м)')
plt.grid(True, alpha=0.3)
plt.legend()
plt.xlim(0, 160)


# График 2: Скорость от времени
plt.figure(figsize=(10, 6))
plt.plot(time_array, v_values, label='Мат. модель', color='blue', linewidth=2)
plt.plot(KSP_Time, KSP_Speed, label='KSP', color='red', linestyle='--', linewidth=2)
plt.title('Скорость ракеты от времени', fontsize=12, fontweight="bold")
plt.xlabel('Время (с)')
plt.ylabel('Скорость (м/с)')
plt.grid(True, alpha=0.3)
plt.legend()
plt.xlim(0, 160)

import matplotlib.patches as mpatches

plt.figure(figsize=(10, 6))
plt.plot(x_values, y_values, label='Мат. модель', color='blue', linewidth=2)
plt.title('График полета мат модели', fontsize=12, fontweight="bold")
plt.xlabel('X - координата')
plt.ylabel('Y - координата')
plt.grid(True, alpha=0.3)
plt.legend()
plt.ylim(-600000, 150000)
plt.xlim(0, 600000)

ax = plt.gca()
# Добавляем окружность
circle = mpatches.Circle((0, -600000), 600000,
                         edgecolor='red',
                         facecolor='none',  # без заливки
                         linewidth=2,
                         linestyle='--',
                         alpha=0.7,
                         label='Поверхность кербина')
ax.add_patch(circle)
# Обновляем легенду
plt.legend()

plt.show()

